# ViewSolarstudySingledayFrameValue Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudySingledayFrameValue Property
ParameterTypeId Class See Also
---
"Single day frame"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudySingledayFrameValue { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudySingledayFrameValue As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudySingledayFrameValue {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace